---
kind: other
id: Methods.T:Autodesk.Revit.DB.IDuplicateTypeNamesHandler
source: html/e7e17ddb-9b86-bad4-ea95-e3d8157e8a6e.htm
---
# IDuplicateTypeNamesHandler Methods

Called when the destination document contains types with the same names as the types being copied.